In [57]:
import warnings
warnings.filterwarnings('ignore')

In [61]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()
grouped=df.groupby('Survived')
grouped.first()
grouped.last()
#data1.get_group(1)
#data1.get_group(0)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,,,,,,,,,,,
0,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,B51 B53 B55,Q
1,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C

In [1]:
category = df.groupby(['Survived', 'Pclass'])
category.first()

NameError: name 'df' is not defined

In [43]:
df.groupby('Survived').mean()

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

In [44]:
#Numerical Column Grouping
grouped =  df.groupby('Survived')
avgs = grouped['Age'].mean().add_suffix('=avg')
avgs

Survived
0=avg    30.626179
1=avg    28.343690
Name: Age, dtype: float64

In [45]:
grouped = df.groupby('Sex')
cnt = grouped['Survived'].count().add_suffix('-Count')
cnt

Sex
female-Count    314
male-Count      577
Name: Survived, dtype: int64

In [46]:
df.groupby(by=["Pclass"]).sum()

        PassengerId  Survived      Age  SibSp  Parch        Fare
Pclass
1             99705       136  7111.42     90     77  18177.4125
2             82056        87  5168.83     74     70   3801.8417
3            215625       119  8924.92    302    193   6714.6951

In [47]:
df.groupby(by=["Pclass"]).min()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare
Pclass,,,,,,,,,
1,2,0,"Allen, Miss. Elisabeth Walton",female,0.92,0,0,110152,0.0
2,10,0,"Abelson, Mr. Samuel",female,0.67,0,0,11668,0.0
3,1,0,"Abbing, Mr. Anthony",female,0.42,0,0,12460,0.0

In [48]:
df.groupby(by=["Pclass"]).max()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare
Pclass,,,,,,,,,
1,890,1,"Young, Miss. Marie Grice",male,80.0,3,4,WE/P 5735,512.3292
2,887,1,"del Carlo, Mr. Sebastiano",male,70.0,3,3,W/C 14208,73.5000
3,891,1,"van Melkebeke, Mr. Philemon",male,74.0,8,6,W./C. 6609,69.5500

In [55]:
grouped=df.groupby(by=["Pclass"]).max()
grouped['Age']

Pclass
1    80.0
2    70.0
3    74.0
Name: Age, dtype: float64